debug-artifacts/load-tests/20260410T102719Z-authfix-smoke-eu/eu-smoke-console.log
[k6] K6 version: k6 v0.53.0 (commit/f82a27da8f, go1.22.6, linux/amd64)
[k6] Pre-flight: checking https://35.244.162.92.nip.io/nginx-health ...
[k6] Results will be written to: json=debug-artifacts/load-tests/20260410T102719Z-authfix-smoke-eu/eu-smoke-metrics.json

╔══════════════════════════════════════════════════╗
║         VCS K6 LOAD TEST RUNNER                ║
╚══════════════════════════════════════════════════╝

[k6] Scenario  : SMOKE
[k6] Target    : https://35.244.162.92.nip.io
[k6] Results   : /home/ajinkyataranekar26/distributed-vehicle-capacity-system/scripts/load-testing/results/summary-smoke-20260410T103123.json

[k6] Running: k6 run --out json=debug-artifacts/load-tests/20260410T102719Z-authfix-smoke-eu/eu-smoke-metrics.json --summary-export /home/ajinkyataranekar26/distributed-vehicle-capacity-system/scripts/load-testing/results/summary-smoke-20260410T103123.json --env K6_SCENARIO=smoke --env BASE_URL=https://35.244.162.92.nip.io /home/ajinkyataranekar26/distributed-vehicle-capacity-system/scripts/load-testing/k6-load-test.js


          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: /home/ajinkyataranekar26/distributed-vehicle-capacity-system/scripts/load-testing/k6-load-test.js
        output: json (debug-artifacts/load-tests/20260410T102719Z-authfix-smoke-eu/eu-smoke-metrics.json)

     scenarios: (100.00%) 1 scenario, 1 max VUs, 1m0s max duration (incl. graceful stop):
              * smoke: 1 looping VUs for 30s (gracefulStop: 30s)

time="2026-04-10T10:31:23Z" level=info msg="\n============================================================" source=console
time="2026-04-10T10:31:23Z" level=info msg="VCS Load Test — Scenario: SMOKE" source=console
time="2026-04-10T10:31:23Z" level=info msg="Base URL: https://35.244.162.92.nip.io" source=console
time="2026-04-10T10:31:23Z" level=info msg="============================================================\n" source=console

running (0m01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [   3% ] 1 VUs  01.0s/30s

running (0m02.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [   7% ] 1 VUs  02.0s/30s

running (0m03.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  10% ] 1 VUs  03.0s/30s

running (0m04.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  13% ] 1 VUs  04.0s/30s

running (0m05.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
smoke   [  17% ] 1 VUs  05.0s/30s

running (0m06.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
smoke   [  20% ] 1 VUs  06.0s/30s

running (0m07.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
smoke   [  23% ] 1 VUs  07.0s/30s

running (0m08.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
smoke   [  27% ] 1 VUs  08.0s/30s

running (0m09.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
smoke   [  30% ] 1 VUs  09.0s/30s

running (0m10.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
smoke   [  33% ] 1 VUs  10.0s/30s

running (0m11.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
smoke   [  37% ] 1 VUs  11.0s/30s

running (0m12.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
smoke   [  40% ] 1 VUs  12.0s/30s

running (0m13.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
smoke   [  43% ] 1 VUs  13.0s/30s

running (0m14.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
smoke   [  47% ] 1 VUs  14.0s/30s

running (0m15.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
smoke   [  50% ] 1 VUs  15.0s/30s

running (0m16.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
smoke   [  53% ] 1 VUs  16.0s/30s

running (0m17.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
smoke   [  57% ] 1 VUs  17.0s/30s

running (0m18.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
smoke   [  60% ] 1 VUs  18.0s/30s

running (0m19.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
smoke   [  63% ] 1 VUs  19.0s/30s

running (0m20.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
smoke   [  67% ] 1 VUs  20.0s/30s

running (0m21.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
smoke   [  70% ] 1 VUs  21.0s/30s

running (0m22.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
smoke   [  73% ] 1 VUs  22.0s/30s

running (0m23.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
smoke   [  77% ] 1 VUs  23.0s/30s

running (0m24.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
smoke   [  80% ] 1 VUs  24.0s/30s

running (0m25.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
smoke   [  83% ] 1 VUs  25.0s/30s

running (0m26.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
smoke   [  87% ] 1 VUs  26.0s/30s

running (0m27.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
smoke   [  90% ] 1 VUs  27.0s/30s

running (0m28.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
smoke   [  93% ] 1 VUs  28.0s/30s

running (0m29.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
smoke   [  97% ] 1 VUs  29.0s/30s

running (0m30.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
smoke   [ 100% ] 1 VUs  30.0s/30s

running (0m31.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
smoke ↓ [ 100% ] 1 VUs  30s

running (0m32.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
smoke ↓ [ 100% ] 1 VUs  30s

running (0m33.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
smoke ↓ [ 100% ] 1 VUs  30s

running (0m34.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
smoke ↓ [ 100% ] 1 VUs  30s
time="2026-04-10T10:31:57Z" level=info msg="\n============================================================" source=console
time="2026-04-10T10:31:57Z" level=info msg="Test complete — Scenario: smoke" source=console
time="2026-04-10T10:31:57Z" level=info msg="Target: https://35.244.162.92.nip.io" source=console
time="2026-04-10T10:31:57Z" level=info msg="Circuit breaker trips detected: check circuit_breaker_trips metric" source=console
time="2026-04-10T10:31:57Z" level=info msg="============================================================\n" source=console

     █ auth: register

       ✓ register: status 201 or 409

     █ auth: get profile

       ✓ profile: status 200
       ✓ profile: has email

     █ map: search places

       ✓ search: status 200 or 429

     █ map: get route

       ✗ route: status 200 or 422
        ↳  0% — ✓ 0 / ✗ 5

     █ capacity: check availability

       ✓ segments: status 200
       ✓ segments: is array

     █ capacity: occupancy

       ✓ occupancy: status 200

     █ journey: create

       ✗ journey create: status 201 or 422
        ↳  0% — ✓ 0 / ✗ 4
       ✓ journey create: not 5xx (except 503)

     █ health: gateway

       ✓ nginx healthy: status 200

     █ notifications: list

       ✓ notifications: status 200

     █ notifications: mark all read

       ✓ mark-read: status 200 or 204

   ✓ auth_success...................: 100.00% ✓ 7        ✗ 0  
   ✓ capacity_check_duration........: avg=298.5ms  min=235ms    med=238ms    max=483ms    p(90)=410.4ms  p(95)=446.69ms
     checks.........................: 83.33%  ✓ 45       ✗ 9  
     data_received..................: 193 kB  5.7 kB/s
     data_sent......................: 13 kB   373 B/s
     group_duration.................: avg=179.8ms  min=4.09ms   med=67.85ms  max=621.5ms  p(90)=407.87ms p(95)=496.03ms
     http_req_blocked...............: avg=291.62µs min=348ns    med=707ns    max=6.62ms   p(90)=1.02µs   p(95)=255.79µs
     http_req_connecting............: avg=22.92µs  min=0s       med=0s       max=477.48µs p(90)=0s       p(95)=21.97µs 
   ✓ http_req_duration..............: avg=174.63ms min=3.81ms   med=45.77ms  max=615.85ms p(90)=406.75ms p(95)=488.55ms
       { expected_response:true }...: avg=206.32ms min=3.81ms   med=235.54ms max=615.85ms p(90)=409.26ms p(95)=535.04ms
   ✗ http_req_failed................: 22.50%  ✓ 9        ✗ 31 
     http_req_receiving.............: avg=47.57ms  min=79.42µs  med=134.06µs max=465.24ms p(90)=220.16ms p(95)=240.6ms 
     http_req_sending...............: avg=131.15µs min=63.28µs  med=114.32µs max=334.3µs  p(90)=202.21µs p(95)=235.84µs
     http_req_tls_handshaking.......: avg=235.27µs min=0s       med=0s       max=5ms      p(90)=0s       p(95)=220.22µs
     http_req_waiting...............: avg=126.92ms min=3.62ms   med=19.19ms  max=615.16ms p(90)=387.11ms p(95)=417.85ms
     http_reqs......................: 40      1.175185/s
     iteration_duration.............: avg=3.78s    min=130.54µs med=3.75s    max=8.37s    p(90)=7.04s    p(95)=7.71s   
     iterations.....................: 7       0.205657/s
   ✗ journey_create_success.........: 0.00%   ✓ 0        ✗ 4  
   ✓ route_compute_duration.........: avg=18.6ms   min=6ms      med=6ms      max=68ms     p(90)=43.6ms   p(95)=55.79ms 
     vus............................: 1       min=1      max=1
     vus_max........................: 1       min=1      max=1


running (0m34.0s), 0/1 VUs, 7 complete and 0 interrupted iterations
smoke ✓ [ 100% ] 1 VUs  30s
time="2026-04-10T10:31:58Z" level=error msg="thresholds on metrics 'http_req_failed, journey_create_success' have been crossed"